app/controllers/pages_controller.rb

  def index
    #@pages = Page.all
    @pages=Page.paginate :page => params[:page],:order=>'created_at desc',:per_page => 10
---
SELECT "pages".* FROM "pages" ORDER BY title, created_at desc LIMIT 10 OFFSET 0

  def show
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]

  def edit
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("body", "created_at", "permalink", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "MyText"], ["created_at", Thu, 27 Sep 2012 11:30:13 UTC +00:00], ["permalink", "MyString"], ["title", "MyString"], ["updated_at", Thu, 27 Sep 2012 11:30:13 UTC +00:00]]

  def update
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 980190962]]